In [2]:
import pandas as pd
import numpy as np
from datetime import datetime

In [3]:
df = pd.read_csv('customer_dim.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4020 entries, 0 to 4019
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    4020 non-null   int64
 1   name           4020 non-null   object
 2   gender         4020 non-null   object
 3   date_of_birth  4020 non-null   object
 4   occupation     4020 non-null   object
 5   city           4020 non-null   object
 6   state          4020 non-null   object
 7   risk_score     4020 non-null   float64
 8   age            4020 non-null   int64
dtypes: float64(1), int64(2), object(6)
memory usage: 282.8+ KB

In [5]:
df.shape

(4020, 9)

In [6]:
df.dtypes

customer_id        int64
name              object
gender            object
date_of_birth     object
occupation        object
city              object
state             object
risk_score       float64
age                int64
dtype: object

In [7]:
df.isnull().sum()

customer_id      0
name             0
gender           0
date_of_birth    0
occupation       0
city             0
state            0
risk_score       0
age              0
dtype: int64

In [8]:
df.duplicated().sum()

np.int64(0)

In [9]:
df['name'].value_counts()

name
Krishna Banerjee    17
Reyansh Sharma      15
Sneha Das           14
Aditya Bose         13
Sara Gupta          13
                    ..
Dhruv Chopra         1
Dhruv Reddy          1
Sai Banerjee         1
Myra Verma           1
Priya Reddy          1
Name: count, Length: 658, dtype: int64

In [10]:
df['gender'].value_counts()

gender
Female    1358
Male      1353
Other     1309
Name: count, dtype: int64

In [11]:
df['date_of_birth'].value_counts()

date_of_birth
2003-06-26    4
2004-05-21    4
2005-04-24    3
1962-03-02    3
1949-02-23    3
             ..
1949-07-09    1
1999-11-02    1
1959-09-24    1
1999-09-07    1
1980-10-23    1
Name: count, Length: 3640, dtype: int64

In [12]:
df["date_of_birth"] = pd.to_datetime(
    df["date_of_birth"].astype(str).str.strip(),
    errors="coerce",
    dayfirst=True,
    infer_datetime_format=True
)

C:\Users\swath\AppData\Local\Temp\ipykernel_16132\1332367848.py:1: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df["date_of_birth"] = pd.to_datetime(
C:\Users\swath\AppData\Local\Temp\ipykernel_16132\1332367848.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df["date_of_birth"] = pd.to_datetime(

In [13]:
df.dtypes

customer_id               int64
name                     object
gender                   object
date_of_birth    datetime64[ns]
occupation               object
city                     object
state                    object
risk_score              float64
age                       int64
dtype: object

In [14]:
df['occupation'].value_counts()

occupation
Retired                1468
Student                 788
Salaried                317
Teacher                 231
Business Owner          223
Lawyer                  215
Government Employee     213
Self-employed           207
Engineer                206
Doctor                  152
Name: count, dtype: int64

In [15]:
df['city'].value_counts()

city
Jaipur              108
Raipur              103
Allahabad           102
Indore              101
Meerut              101
Aurangabad           99
Jodhpur              99
Kolkata              99
Jabalpur             99
Bhopal               98
Kalyan-Dombivli      98
Coimbatore           98
Srinagar             97
Rajkot               96
Lucknow              95
Ghaziabad            93
Ranchi               93
Howrah               92
Patna                90
Madurai              90
Gwalior              90
Navi Mumbai          87
Surat                85
Varanasi             85
Bengaluru            84
Vijayawada           84
Ahmedabad            84
Vadodara             83
Nashik               83
Nagpur               83
Pune                 83
Dhanbad              82
Amritsar             82
Visakhapatnam        80
Vasai-Virar          80
Pimpri-Chinchwad     79
Hyderabad            79
Chennai              79
Kota                 76
Faridabad            75
Kanpur               75
Delhi                75
Ludhiana             73
Agra                 68
Mumbai               68
Thane                67
Name: count, dtype: int64

In [16]:
df['state'].value_counts()

state
Maharashtra        827
Uttar Pradesh      619
Madhya Pradesh     388
Gujarat            348
Rajasthan          283
Tamil Nadu         267
West Bengal        191
Jharkhand          175
Andhra Pradesh     164
Punjab             155
Chhattisgarh       103
Jammu & Kashmir     97
Bihar               90
Karnataka           84
Telangana           79
Haryana             75
Delhi               75
Name: count, dtype: int64

In [17]:
df.head(25)

,customer_id,name,gender,date_of_birth,occupation,city,state,risk_score,age
0,1,Sai Reddy,Other,1990-11-24,Business Owner,Navi Mumbai,Maharashtra,0.58,33
1,2,Aditya Yadav,Male,2004-12-21,Student,Raipur,Chhattisgarh,0.43,19
2,3,Sara Sharma,Female,1953-03-07,Retired,Ludhiana,Punjab,0.13,70
3,4,Krishna Kapoor,Male,2006-08-19,Student,Allahabad,Uttar Pradesh,0.80,17
4,5,Arnav Shetty,Other,1999-04-25,Business Owner,Patna,Bihar,0.82,24
5,6,Reyansh Menon,Male,1960-11-09,Retired,Raipur,Chhattisgarh,0.60,63
6,7,Aditya Patel,Male,1947-07-19,Retired,Ghaziabad,Uttar Pradesh,0.26,76
7,8,Rahul Kapoor,Male,1980-10-23,Salaried,Ghaziabad,Uttar Pradesh,0.64,43
8,9,Avni Das,Female,1974-12-18,Self-employed,Navi Mumbai,Maharashtra,0.72,49
9,10,Priya Menon,Female,1990-02-25,Business Owner,Hyderabad,Telangana,0.19,33
10,11,Rahul Gowda,Male,1958-08-17,Retired,Visakhapatnam,Andhra Pradesh,0.82,65
11,12,Vihaan Rao,Male,1973-06-04,Lawyer,Patna,Bihar,0.19,50
12,13,Shaurya Kapoor,Male,1985-02-28,Lawyer,Gwalior,Madhya Pradesh,0.81,38
13,14,Rohan Menon,Other,1940-10-11,Retired,Aurangabad,Maharashtra,0.15,83
14,15,Kiara Jain,Female,2000-10-03,Business Owner,Chennai,Tamil Nadu,0.78,23
15,16,Rohan Rao,Other,1962-02-08,Retired,Raipur,Chhattisgarh,0.69,61
16,17,Avni Menon,Female,1941-04-08,Retired,Ahmedabad,Gujarat,0.07,82
17,18,Aarav Gupta,Other,2005-08-07,Student,Dhanbad,Jharkhand,0.30,18
18,19,Myra Shetty,Female,1947-08-26,Retired,Rajkot,Gujarat,0.13,76
19,20,Dhruv Naidu,Other,1961-12-25,Retired,Hyderabad,Telangana,0.71,62
20,21,Sai Das,Male,1953-08-08,Retired,Ahmedabad,Gujarat,0.78,70
21,22,Kavya Sharma,Other,1977-08-16,Salaried,Indore,Madhya Pradesh,0.86,46
22,23,Rohan Das,Male,1953-12-26,Retired,Allahabad,Uttar Pradesh,0.19,70
23,24,Aadhya Bose,Female,2002-01-15,Student,Amritsar,Punjab,0.10,21
24,25,Arjun Gowda,Other,1977-10-08,Salaried,Howrah,West Bengal,0.61,46

In [18]:
df['risk_score'].value_counts()

risk_score
0.12    64
0.94    61
0.38    60
0.72    58
0.09    56
        ..
0.66    32
0.89    29
0.54    25
0.05    22
0.95    16
Name: count, Length: 91, dtype: int64

In [19]:
df.dtypes

customer_id               int64
name                     object
gender                   object
date_of_birth    datetime64[ns]
occupation               object
city                     object
state                    object
risk_score              float64
age                       int64
dtype: object

In [21]:
df.head()

,customer_id,name,gender,date_of_birth,occupation,city,state,risk_score,age
0,1,Sai Reddy,Other,1990-11-24,Business Owner,Navi Mumbai,Maharashtra,0.58,33
1,2,Aditya Yadav,Male,2004-12-21,Student,Raipur,Chhattisgarh,0.43,19
2,3,Sara Sharma,Female,1953-03-07,Retired,Ludhiana,Punjab,0.13,70
3,4,Krishna Kapoor,Male,2006-08-19,Student,Allahabad,Uttar Pradesh,0.80,17
4,5,Arnav Shetty,Other,1999-04-25,Business Owner,Patna,Bihar,0.82,24

In [22]:
df.to_csv(r"C:\Users\swath\Downloads\customer.csv", index=False)